In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_excel("titanic_train.xlsx")
train = pd.read_csv('train.csv')

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Variable Description
# PassengerId : unique id number to eacch passenger
# Survived : passenger survive or died
# Pclass : passenger class
# Name : name
# Sex : gender of passenger
# Age : age of passenger
# SibSp : number ıf siblings/spouses
# Parch : number of parents/children
# Ticket : ticket number
# Fare : amount of money spent on ticket
# Cabin : cabin category
# Embarked : port where passenger embarked

In [4]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
titanic.shape

(891, 12)

In [7]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
len(titanic)

891

In [9]:
len(titanic["Cabin"])
#len(titanic["Cabin"].unique())
titanic['Cabin'].isna().sum()

687

# Q1. Create a Feature that tells whether a passenger had a cabin on Titanic or not.

In [10]:
titanic['Cabin'].fillna("No", inplace = True)

titanic
#titanic[['Cabin', 'Name']].groupby(['Cabin'], as_index=False).sort_values(by='Name', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,No,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,No,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,No,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,No,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,No,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,No,Q

# Q2. In 'Fare' Find Null Value and fill with median value

In [11]:
fare = titanic["Fare"]
med = fare.median()
fare.fillna(med)

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

# Q3. Create a feature and find the size of Family

In [12]:
titanic['Family_Size']= titanic['SibSp']+titanic['Parch']
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_Size
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,No,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,No,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,No,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,No,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,No,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,No,Q,0

# Q4. Find the Ratio of Male and Female in Dataset using Groupby Function

In [13]:
titanic.groupby(by='Sex').size()

Sex
female    314
male      577
dtype: int64

In [14]:
titanic[["Sex","Survived"]].groupby(["Sex"], as_index = False).mean().sort_values(by= "Survived",ascending = False)

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [15]:
titanic.Sex.value_counts(normalize= True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

# Q5. Change the (Sex) Feature into Categorical to Numerical or Ordinal

In [16]:
from sklearn.preprocessing import LabelEncoder
number = LabelEncoder()

titanic['Sex'] = number.fit_transform(titanic['Sex'].astype('str'))

In [17]:
titanic['Sex'].dtype

dtype('int32')

# Q6. Write a code that finds the number of males who survived and whose age is 22 years old or younger on train.csv

In [18]:
train = pd.read_csv('train.csv')

In [19]:
survived = train[train['Age']<=22] #titanic.groupby('Sex')['Age']<=22


s = train.loc[train['Age']<=22]
survived_males = s[s['Sex'] == 'male']
survived_males.reset_index()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
2,12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
3,16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
4,27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
130,850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.0,4,2,347082,31.2750,NaN,S
131,861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
132,869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
133,876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
134,877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S

In [20]:
print("Total no. of survived males is ",survived_males.shape[0])

Total no. of survived males is  135

# Q7. Write a code that finds how much was the average fare for 1st passenger class (Pclass)

In [21]:
class1_passenger = train.loc[train['Pclass']==1]
class1_passenger[['Pclass', 'Fare']].reset_index()

     index  Pclass     Fare
0        1       1  71.2833
1        3       1  53.1000
2        6       1  51.8625
3       11       1  26.5500
4       23       1  35.5000
..     ...     ...      ...
211    871       1  52.5542
212    872       1   5.0000
213    879       1  83.1583
214    887       1  30.0000
215    889       1  30.0000

[216 rows x 3 columns]

In [22]:
avg_fare = class1_passenger['Fare'].mean()
print("The average fare for 1st passenger class is " ,avg_fare)

The average fare for 1st passenger class is  84.15468749999992

# Q8. Write a code that categories Embarked places and finds min, max, mean and count of Fare

In [23]:
train[train["Fare"].isnull()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [24]:
train["Embarked"] = train["Embarked"].fillna("C")

In [25]:
print("The categorized Embarked places and min, max, mean and count of Fare are:")
#titanic.groupby('Embarked').agg({'Fare': [np.mean, np.min, np.max]})
titanic.groupby('Embarked').agg({'Fare': ['mean', 'min', 'max','count']})

The categorized Embarked places and min, max, mean and count of Fare are:

               Fare
               mean     min       max count
Embarked
C         59.954144  4.0125  512.3292   168
Q         13.276030  6.7500   90.0000    77
S         27.079812  0.0000  263.0000   644

# Q9 Write a code that finds the ticket number of 'Nakid, Mr. Sahid' on train.csv

In [26]:
#ticket = train[['Name', 'Ticket']]

ticketno = train[train["Name"] == 'Nakid, Mr. Sahid']

#t_n = ticketno['Ticket'].to_string(index = False)
t_n = ticketno.Ticket.item()

In [27]:
print('Nakid, Mr. Sahids ticket number was ', t_n)

Nakid, Mr. Sahids ticket number was  2653

In [28]:
train_ = train[train["Name"] == "Nakid, Mr. Sahid"]
value = train_.Name.item()
value

'Nakid, Mr. Sahid'

# Q10 Write a code using titanic_data (made Question 5) that shows
# (1) Percentage of children with parents who survived, 
# (2) Percentage of children without parents who survived, 
# (3) Average age of surviving children with parents, 
# (4) Average age of surviving children without parents 
# (Note: 1st, use ‘Age’ and ‘Parch’, 2nd, children means passengers under 18)

In [29]:
titanic['Age'].count()

714

In [30]:
m = titanic['Age'].mean()
m

29.69911764705882

In [31]:
titanic['Age'].fillna(m, inplace = True)

titanic['Age'].count()

891

In [32]:
children = titanic['Age'] < 18
children.value_counts() # normalize = True

False    778
True     113
Name: Age, dtype: int64

In [33]:
children_survived = titanic['Survived'] == 1

children_survived.value_counts()

False    549
True     342
Name: Survived, dtype: int64

In [34]:
# true_count = titanic['Survived'].sum()
# true_count
# false_count = ~titanic['Survived'].sum()
# false_count

-343

In [35]:
children_with_parent = titanic['Parch'] > 0
children_without_parent = titanic['Parch'] == 0
children_with_parent.value_counts()

False    678
True     213
Name: Parch, dtype: int64

In [36]:
titanic.groupby(by='Parch').size()

Parch
0    678
1    118
2     80
3      5
4      4
5      5
6      1
dtype: int64

# (1) Percentage of children with parents who survived,

In [37]:
task_children = children & children_survived & children_with_parent
task_children.value_counts(normalize = True).mul(100).astype(str)+'%'

False    94.94949494949495%
True      5.05050505050505%
dtype: object

In [38]:
task_percentage = titanic[task_children]
task_percentage['Age'].count()

45

In [39]:
Percentage = (task_percentage['Age'].count()/titanic['Age'].count()) * 100
Percentage

5.05050505050505

# (2) Percentage of children without parents who survived

In [40]:
task_children_no_p = children & children_survived & children_without_parent
task_children_no_p.value_counts(normalize = True).mul(100).astype(str)+'%'

False     98.20426487093154%
True     1.7957351290684627%
dtype: object

In [42]:
task_percentage_no = titanic[task_children_no_p]
task_percentage_no['Age'].count()

16

In [44]:
percentage = (task_percentage_no['Age'].count()/titanic['Age'].count()) * 100
percentage

1.7957351290684627

# (3) Average age of surviving children with parents

In [45]:
task_percentage['Age'].mean()

5.470444444444444

# (4) Average age of surviving children without parents

In [46]:
task_percentage_no['Age'].mean()

14.6875